In [1]:
import pandas as pd

#Sample data dictionary

In [2]:
data = {
    'Product': ['Pen', 'Pencil', 'Notebook', 'Eraser'],
    'Price': [10, 5, 50, 3],
    'InStock': [True, True, False, True]
}

# Create DataFrame

#In Python (especially with Pandas), 2D data is usually stored as a DataFrame:

In [3]:
df = pd.DataFrame(data)

In [4]:
df

    Product  Price  InStock
0       Pen     10     True
1    Pencil      5     True
2  Notebook     50    False
3    Eraser      3     True

In [5]:
df

    Product  Price  InStock
0       Pen     10     True
1    Pencil      5     True
2  Notebook     50    False
3    Eraser      3     True

‚úÖ 1. df.head() ‚Äî View Top Rows

üîπ Shows the first 5 rows (by default). Great for previewing.

In [7]:
df.head()

    Product  Price  InStock
0       Pen     10     True
1    Pencil      5     True
2  Notebook     50    False
3    Eraser      3     True

‚úÖ 2. df.tail() ‚Äî View Bottom Rows

In [8]:
df.tail(2)

    Product  Price  InStock
2  Notebook     50    False
3    Eraser      3     True

In [ ]:
By default show 5 rows but when passed params then show according passed values

‚úÖ 3. df.shape ‚Äî Rows and Columns

In [9]:
df.shape

(4, 3)

üì¶ Output: (4, 3) ‚Üí 4 rows, 3 columns

‚úÖ 4. df.columns ‚Äî Column Names

In [10]:
df.columns

Index(['Product', 'Price', 'InStock'], dtype='object')

‚úÖ 5. df.dtypes ‚Äî Data Types

In [11]:
df.dtypes

Product    object
Price       int64
InStock      bool
dtype: object

‚úÖ 6. df.info() ‚Äî Quick Data Overview

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Product  4 non-null      object
 1   Price    4 non-null      int64
 2   InStock  4 non-null      bool
dtypes: bool(1), int64(1), object(1)
memory usage: 200.0+ bytes

üìã Shows:

Number of rows
, Column names and types
, Non-null count

‚úÖ 7. df.describe() ‚Äî Statistics Summary (numeric columns)

In [13]:
df.describe()

           Price
count   4.000000
mean   17.000000
std    22.196096
min     3.000000
25%     4.500000
50%     7.500000
75%    20.000000
max    50.000000

üìä Gives mean, min, max, std, etc. (only for numbers like Price)

‚úÖ 8. df['Price'] ‚Äî Access a Single Column (Series)

In [14]:
df["Price"]

0    10
1     5
2    50
3     3
Name: Price, dtype: int64

üìã Output: A column with just prices.

‚úÖ 9. df[['Product', 'Price']] ‚Äî Select Multiple Columns

In [16]:
df[['Product', 'Price']]

    Product  Price
0       Pen     10
1    Pencil      5
2  Notebook     50
3    Eraser      3

üìã Output: A smaller DataFrame with selected columns.

‚úÖ 10. df[df['InStock'] == True] ‚Äî Filter Rows

In [20]:
df[df['InStock'] == True] #df[df['InStock']]

  Product  Price  InStock
0     Pen     10     True
1  Pencil      5     True
3  Eraser      3     True

üîç Output: Only rows where the product is in stock.

‚úÖ 11. df.sort_values(by='Price', ascending=False) ‚Äî Sort

In [21]:
df.sort_values(by='Price')

    Product  Price  InStock
3    Eraser      3     True
1    Pencil      5     True
0       Pen     10     True
2  Notebook     50    False

In [22]:
df.sort_values(by='Price', ascending=False)

    Product  Price  InStock
2  Notebook     50    False
0       Pen     10     True
1    Pencil      5     True
3    Eraser      3     True

üìã Sorts by Price in ascending and descending order.

‚úÖ 12. df['Price'].mean() ‚Äî Average Price

In [23]:
df['Price']

0    10
1     5
2    50
3     3
Name: Price, dtype: int64

In [24]:
df['Price'].mean()

np.float64(17.0)

üìä Output: The average of the prices.